Revit 2026 API

# RevitEventArgsCancel Property

---

Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Cancel { get; set; }
```
```vb
Public Overridable Property Cancel As Boolean
	Get
	Set
```
```cpp
public:
virtual property bool Cancel {
	bool get ();
	void set (bool value);
}
```
```fsharp
abstract Cancel : bool with get, set
override Cancel : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if an event delegate attempts to cancel a non-cancellable event. |

If an event delegate wishes to cancel the event, it should set the value of this property to True. Not every event is cancellable. Whether or not an event may be cancelled is indicated by the value of 'Cancellable' property.

#### Reference

RevitEventArgs Class

Autodesk.Revit.DB.Events Namespace